import React from 'react';
import '../css/register.scss';
import {connect} from "react-redux";
import {setUserInformation} from "../redux/action";
import {Modal, Button, Tabs, Form, Input, Checkbox, message} from 'antd';
import {withRouter} from 'react-router-dom';
import {getPhoneCode, register,login} from '../api/index'

class Information extends React.Component {
    constructor(props) {
        super(props)
        this.state = {
            text: '获取验证码',
            disabled: false,
            code: 'http://47.108.87.104:8501/user/verfiyCode'
        }
    }

    //获取手机验证码
    getCode() {
        if(!this.props.form.getFieldValue('phone')){
            message.error('请输入手机号！')
            return
        }
    
        let params = {phone: this.props.form.getFieldValue('phone'),verifyCode:this.props.form.getFieldValue('verifyCode')}
        getPhoneCode(params).then((res) => {
            if(res.data.code==0){
                message.error(res.data.msg)
                return
            }
            else{
                let that = this
                var wait = 60;
                function time() {
                    if (wait == 0) {
                        that.setState({text: "免费获取验证码", disabled: false})
                        wait = 60;
                    } else {
                        that.setState({text: "重新发送(" + wait + ")", disabled: true})
                        wait--;
                        setTimeout(function () {
                            time()
                        }, 1000)
                    }
                }
        
                time()
            }
        })

    }
    changeE(){
        if(this.props.role==='5'){
            this.setState({ agreement: true })
        }
        else if(this.props.role==='3'){
            this.setState({ agent: true })
        }
        else if(this.props.role==='4'){
            this.setState({ consultant: true })
        }
    }
    //注册
    handleSubmit(e) {
        e.preventDefault();
        this.props.form.validateFields((err, values) => {
            if (!(/^1[3456789]\d{9}$/.test(values.phone))) {
                this.props.form.setFields({
                    phone: {
                        value: values.phone,
                        errors: [new Error('请输入正确的手机号')],
                    },
                });
                return false
            }
            if (!err) {
                localStorage.setItem('phone',values.phone)
                localStorage.setItem('phone',values.password)
                let params = {
                    "password": values.password,
                    "phone": values.phone,
                    "phoneCode": values.phoneCode,
                    "role": this.props.role,
                    "verifyCode": values.verifyCode
                }
                register(params).then((res) => {
                    if (res.data.code === 0) {
                        if (res.data.verifyErrorMsg) {
                            this.props.form.setFields({
                                verifyCode: {
                                    value: values.verifyCode,
                                    errors: [new Error('验证码错误')],
                                },
                            })
                            this.createCode()
                        }
                        else if (res.data.phoneVerifyErrorMsg) {
                            this.props.form.setFields({
                                phoneCode: {
                                    value: values.phoneCode,
                                    errors: [new Error('手机验证码错误')],
                                },
                            })
                        }

                        else if (res.data.msg == '该手机号已绑定用户') {
                            message.success('该手机号已注册请去登录！')
                            setTimeout(this.props.handleClose, 1000)

                        }
                        else if(this.props.role==3){
                                message.success('注册成功！请先去填写个人资料！')
                                localStorage.setItem('role',3)
                                localStorage.setItem('userId',res.data.userId)
                                this.props.handleClose()
                                this.props.history.push('/home/registryCenter')
                        }
                        else if(this.props.role==4){
                            message.success('注册成功！请先去填写个人资料！')
                            localStorage.setItem('role',4)
                            localStorage.setItem('userId',res.data.userId)
                            this.props.handleClose()
                            this.props.history.push('/home/registryCenter')
                    }
                    }
                    else {
                        if(this.props.role==3||this.props.role==4){
                            localStorage.setItem('role',this.props.role)
                            localStorage.setItem('userId',res.data.userId)
                            this.props.handleClose()
                            let params = {
                                "password": values.password,
                                "phone": values.phone,
                                "role": this.props.role,
                                "loginType": 2
                            };
                            login(params).then((res) => {
                                if (res.data.code === 0) {
                                    message.error(res.data.msg)
                                }
                                else {
                                    message.success('注册成功！请先去填写个人资料！')
                                    localStorage.setItem('state',res.data.state)
                                    this.props.setUserInformation(res.data)
                                    localStorage.setItem('userName',res.data.name)
                                    localStorage.setItem('role',res.data.role)
                                    localStorage.setItem('userId',res.data.userId)
                                    localStorage.setItem('phone',values.phone)
                                    this.props.history.push('/home/registryCenter')
                                }
                            })
                           
                        }
                        else if(this.props.role==5){
                            message.success('注册成功！')
                            let params = {
                                "password": values.password,
                                "phone": values.phone,
                                "role": this.props.role,
                                "loginType": 2
                            };
                            login(params).then((res) => {
                                if (res.data.code === 0) {
                                    message.error(res.data.msg)
                                }
                                else {
                                    localStorage.setItem('state',res.data.state)
                                    this.props.setUserInformation(res.data)
                                    localStorage.setItem('userName',res.data.name)
                                    localStorage.setItem('role',res.data.role)
                                    localStorage.setItem('userId',res.data.userId)
                                    localStorage.setItem('phone',values.phone)
                                }
                            })
                        setTimeout(this.props.handleClose, 1000) 
              }
                    }

                })
            }
        });
    };

    //生成验证码的方法
    createCode() {
        const num = Math.ceil(Math.random() * 10)
        this.setState({
            code: 'http://47.108.87.104:8501/user/verfiyCode?num=' + num
        })
    }

    // componentDidMount() {
    //     this.createCode()
    // }

    render() {
        const {getFieldDecorator} = this.props.form;
        return (
            <Form onSubmit={this.handleSubmit.bind(this)} className="login-form">
                <Form.Item>
                    {getFieldDecorator('phone', {
                        rules: [{required: true, message: '请输入手机号!'}],
                    })(
                        <Input
                            placeholder="请输入手机号"
                            autoComplete="off"
                            size={'large'}
                        />,
                    )}
                </Form.Item>
                <Form.Item className={'code'}>
                    {getFieldDecorator('verifyCode', {
                        rules: [
                            {required: true, message: '请输入验证码!'},

                        ],
                    })(
                        <Input
                            placeholder="请输入验证码"
                            autoComplete="off"
                            size={'large'}
                        />,
                    )}
                    <div id={this.props.id} className="code" onClick={this.createCode.bind(this, 4)}><img
                        src={this.state.code}/></div>
                </Form.Item>
                <Form.Item>
                    {getFieldDecorator('phoneCode', {
                        rules: [{required: true, message: '请输入短信验证码!'}],
                    })(
                        <Input size={'large'}
                        autoComplete="off"
                               addonAfter={<Button style={{cursor: 'pointer', fontWeight: 'bold'}} block={true}
                                                   onClick={this.getCode.bind(this)}
                                                   disabled={this.state.disabled}>{this.state.text}</Button>}
                               placeholder="请输入短信验证码"/>
                    )}
                </Form.Item>
                <Form.Item>
                    {getFieldDecorator('password', {
                        rules: [{required: true, message: '请输入密码!'}, {min: 6, message: '密码至少6位数'}],
                    })(
                        <Input
                            size={'large'}
                            type="password"
                            autoComplete="off"
                            placeholder="请输入密码"
                        />,
                    )}
                </Form.Item>
                <Form.Item style={{textAlign:'left'}}>
                    {getFieldDecorator('check', {
                        rules: [{required: true, message: '请勾选同意相关协议!'}],
                    })(
                        
                        <div><Checkbox onChange={this.onChange}></Checkbox> 我已阅读并同意<a onClick={(e) => {this.changeE()}}>《e站房屋平台{this.props.tab}协议》</a>及<a  onClick={() => this.setState({ statement: true })}>《e站房屋平台隐私政策及免责声明》</a></div>
                    )}
                </Form.Item>
                <Form.Item>
                    <Button type="primary" htmlType="submit" className="login-form-button" size={'large'}>
                        注册
                    </Button>
                </Form.Item>
                <Modal
                    visible={this.state.agreement}
                    bodyStyle={{height:'600px',overflow:'scroll'}}
                    style={{height:'600px'}}
                    forceRender={true}
                    width={900}
                    destroyOnClose={true}
                    onCancel={() => { this.setState({ agreement: false }) }}
                    footer={''}>
                    <p className='title'>e站房屋平台用户注册协议</p>
                    <p className='userN'>尊敬的e站房屋用户：</p>
                    <p>e站房屋平台（以下简称“我们”或者“平台”）所提供的各项服务的所有权和运营权，均归属于成都叁城房地产经纪有限公司及其关联主体。用户在平台注册，即表示接受本协议的所有条件和条款。<b>用户部分或全部不接受本协议条款的，不得使用平台；在平台注册成功或使用平台服务的，视为完全知晓且同意注册协议的所有条款。</b> 注册协议（以下简称“本协议”）系用户因使用平台的各项服务而与平台订立的正式的、完整的协议。本协议内容同时包括平台可能不断发布或更新的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，用户应当及时查看本协议更新内容，若有异议的应当注销本平台账户，若未有异议且继续使用平台服务的，视为接受本协议的更新内容。</p>
                    <p>第一条 定义</p>
                    <p>1.1 e站房屋平台：指e站房屋网站（域名：ezhanhome.com）及e站房屋客户端、小程序等互联网端口。旨在为用户提供最新购房信息及管理、信息浏览与查询、交易撮合与处理、争议调解等互联网信息服务和在线交易处理服务的网络平台。平台仅为用户与开发商置业顾问、经纪人之间的交易提供网络信息服务支持，若双方因合同履行发生争议的，应当根据合同相对性原则自行协商处理或寻求平台调解争议。</p>
                    <p>1.2 用户：本协议项下指已经下载平台，并自愿申请注册成功的自然人。</p>
                    <p>第二条 服务条款的确认和接受</p>
                    <p>2.1 用户应在使用平台的服务之前认真阅读本协议及相关业务规则内容。如对协议有任何疑问的，应于注册前向平台客服咨询。<b>但无论用户事实上是否在使用平台的服务之前认真阅读了本协议内容，只要用户使用平台的服务，则本协议即对用户产生约束，届时用户不应以未阅读本协议的内容或者未获得平台客服对问询的解答等理由，主张本协议无效，或要求撤销本协议。</b></p>
                    <p>2.2用户在平台完成注册程序，成为平台用户，即视为用户完全同意本协议所有服务条款及平台相关规则。在用户按照注册页面提示填写信息、阅读并同意本协议，完成全部注册程序后，或以平台允许的其他方式实际使用了平台的服务的，即视为用户同意本协议全部条款并受其约束。</p>
                    <p>2.3 用户应当保证注册时提供的信息的完整性、真实性、合法性。平台有权根据业务需要，随时审核用户的注册信息是否完整真实有效。</p>
                    <p>2.4 根据业务需要，平台保留在国家法律允许及本协议约定的范围内，独自决定拒绝服务、中止服务、终止服务或注销用户账户的权利。</p>
                    <p>2.5 根据业务需要，平台保留在国家法律允许的范围内，不时地制订、修改本协议或业务规则，并以网站或者手机APP公示的方式进行公示。<b>如用户继续使用平台的服务的，即表示用户接受经修订的协议和规则。</b></p>
                    <p>2.6 为了保证平台服务的安全性和功能的一致性，平台有权不经向用户特别通知而对应用进行更新，对平台的部分功能效果进行改变或限制。新版本发布后，平台不保证旧版本继续可用及相应的客户服务，用户应随时核对并下载最新版本。</p>
                    <p>第三条 平台服务内容</p>
                    <p>3.1 平台可能为不同的终端设备开发了不同的应用程序版本，用户应当根据实际情况选择下载合适的版本进行安装。平台不保证所有的版本与相关设备的适配性和可用性，亦不保证所有的版本提供的服务的一致性。</p>
                    <p>3.2 平台提供的服务为：最新购房信息及管理、信息浏览与查询、交易撮合与处理、争议调解等互联网信息服务和在线交易处理服务的网络平台。具体以平台届时有效的服务内容为准。</p>
                    <p>3.3 尽管平台尽力保证服务的有效性和可用性，但因电信故障、黑客攻击或政策变动等不可抗力因素，可能导致前述服务部分或全部无效或调整，用户理解并接受该等情形的出现，并放弃因此向平台索赔的权利。</p>
                    <p>3.4 用户必须自行准备如下服务设备，并承担相关服务开支：</p>
                    <p>（1）服务设备，手机。</p>
                    <p>（2）服务开支，包括并不限于网络流量费、结算手续费，以及履行服务过程可能发生的其他费用等。</p>
                    <p>3.5 用户使用平台服务而需要下载相关客户端程序时，平台给予用户一项单个的、不可转让及非排他性的许可。用户仅在使用平台服务时使用相关客户端程序，不进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现相关客户端程序的源代码；不得删除相关客户端程序及其副本上关于著作权的信息。用户终止使用平台服务时，应当立即删除相关客户端程序及其数据。</p>
                    <p>第四条 账户管理</p>
                    <p>4.1用户注册成功后，将生成由用户自行设置的用户名和密码等账户信息。用户可以根据平台的业务规则改变密码。用户应谨慎合理的保存、使用其用户名和密码，并对利用用户的用户名和密码完成管理权限验证而实施的所有行为、活动及事件负全责。用户若发现任何不当使用用户账号或存在安全漏洞等其他可能危及用户账户安全的情况，应当立即以有效方式通知平台，要求平台暂停相关服务，并向公安机关报案。</p>
                    <p>4.2 用户依据前述条款发出的通知<b>至少应当包括情况描述，相关的初步证据，要求平台处理措施，通知人联系信息等，缺乏前述信息的通知视为无效通知。</b>用户理解平台对用户的通知请求识别、采取行动需要合理时间，平台对在采取行动前已经产生的后果（包括但不限于用户已产生或不可避免的经济损失、名誉损失）及非因平台原因产生的后果不承担任何责任。   </p>
                    <p>4.3 用户理解并同意，平台有权使用用户的注册信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证；同时，为了更好的为用户提供服务，平台及其关联方可以无偿的、商业性的分析和使用用户注册信息及使用数据（详见隐私政策及免责声明）。</p>
                    <p>4.4 用户注册帐号后如果长期不登录该帐号，平台有权回收、注销该帐号，以免造成资源浪费，由此带来的任何损失均由用户自行承担。</p>
                    <p>4.5 所有违反协议约定或者平台规则的行为，平台都有权根据违规情节和性质进行相应的处理，直至封禁账号（拉黑）处理，违规情节和性质由平台依据相关法律或平台规则或双方事先约定最终确定。平台不可能事先列举所有违规事项和处理措施，对未事先列举的，由平台依据诚实信用原则或公序良俗原则予以确定。</p>
                    <p><b>第五条 责任范围与责任限制（重要）</b></p>
                    <p>5.1 用户理解并同意，为用户提供房产信息的相对方为开发商置业顾问或者经纪人，平台对相关信息的真实性、合法性均不作任何承诺。合同履行的瑕疵及违约责任应当由根据约定内容承担，作为交易信息平台的平台，与开发商、置业顾问、经纪人都是独立的商事主体，不为商家及承担任何担保或连带责任。</p>
                    <p>5.2 用户在履行合同之前，应当自行审核交易的真实性及履约能力，作为交易信息平台的平台，不承担任何担保或连带责任。特别地，平台作为交易信息平台，无法控制交易的安全或合法性、真实性或准确性。用户因交易遭受人身损害、财产损害的，或造成第三方人身损害、财产损害的，应当依法向责任主体追究法律责任，平台不承担任何责任。</p>
                    <p>5.3 有且仅当法律法规明确要求，或出现以下情况，平台才对用户注册信息等进行事先或事后的审查：</p>
                    <p>（1）应用户要求的，且有合理的理由认为相关交易可能存在重大违法或违约情形。</p>
                    <p>（2）应用户要求的，且有合理理由认为用户在平台的行为涉嫌违法或不当。用户理解并同意并积极配合平台审查行为，平台可自行决定审查终结时间，审查终结前，平台可按相关规则对用户、用户账号、数据进行审查。</p>
                    <p>5.4 如因不可抗力或其他平台无法控制的原因使平台系统崩溃或无法正常使用，从而导致交易无法完成或丢失有关的信息、记录等，平台不承担责任。平台会尽可能合理地协助处理善后事宜，并努力使用户免受或减少经济损失。</p>
                    <p>5.5 用户同意在发现平台任何内容不符合法律规定，或不符合本协议规定的，有义务及时通知平台。如果用户发现合法权利受到侵害，请将此情况告知平台并同时提供如下信息和材料：</p>
                    <p>（1）侵犯用户权利的信息的网址，编号或其他可以找到该信息的细节；</p>
                    <p>（2）用户的联系方式，包括联系人姓名，地址，电话号码和电子邮件；</p>
                    <p>（3）用户的身份证复印件等其他相关资料。</p>
                    <p>（4）平台要求提供的其他相关材料。</p>
                    <p>经审查得到证实的，平台将及时删除相关信息。</p>
                    <p>5.6 用户应当严格遵守本协议及平台发布的其他协议、活动规则，因用户违反协议或规则的行为给第三方或平台造成损失的，用户应当承担全部责任，平台因此承担责任的，有权向用户追偿。</p>
                    <p>5.7 用户理解并同意，平台可能会与第三方合作向用户提供相关的服务（包括但不限于广告服务、支付服务、寻址定位服务），在此情况下，平台不保证该第三方提供的服务的可用性、有效性和合法性。</p>
                    <p>5.8 平台在本协议中仅为用户提供信息服务，除本协议约定应由平台承担的义务外，用户与开发商、置业顾问、经纪人达成的具体业务及过程中产生的全部权利义务，由双方自行承担，与平台无关。如因双方合同义务履行不当给平台造成任何损失的，平台有权向责任人追偿。</p>
                    <p>第六条 对用户信息的存储和限制</p>
                    <p> 6.1 平台不对用户所保留的信息的删除或储存失败负责，用户应当自行备份用户信息及使用数据。</p>
                    <p>6.2 用户账户被注销后，平台没有义务为其保留或向其披露其账户中的任何信息，也没有义务向用户或第三方转发任何用户未曾阅读或发送过的信息</p>
                    <p>第七条 信息与数据所有权</p>
                    <p>7.1 平台各项信息服务及其载体，以及交易处理数据的所有权和运营权归成都叁城房地产经纪有限公司，平台可依自身义务需要采取任何商业性利用或开发。</p>
                    <p>7.2 平台服务内容的方式包括：文字、软件、声音、图片、录像、图表、广告中的全部内容；电子邮件的全部内容；平台为用户提供的其他信息。所有这些内容受版权、商标、标签和其它法律的保护。用户可在在平台和广告商的书面授权下使用这些内容。但不能擅自复制、再造这些内容、或创造与内容有关的衍生产品。平台所有的文章版权归原文作者和平台共同所有，任何人需要转载该等文章或信息，必须征得原文作者或平台书面授权。</p>
                    <p> 7.3 <b>用户接受本协议条款，即表明该用户将其在平台发表的任何形式的信息的著作权或其他合法权利，包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利无偿独家转让给平台所有，同时表明该用户许可平台有权就任何主体侵权而单独提起诉讼，并获得全部赔偿。</b>本协议效力及于用户在平台发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。若因该内容侵犯第三人的著作权或其他合法权利，成都叁城房地产经纪有限公司因此遭受损害的，有权向用户追偿。同时，平台保留删除站内各类不符合规定或侵权信息而不通知用户的权利。</p>
                    <p>第八条 用户行为规范</p>
                    <p>8.1 用户须严格按照平台提供、发布、更新的服务条款和业务规则执行。平台不时发布的成文或非成文的业务规则，以及既成的交易模式或惯例，视为本协议的重要组成部分。</p>
                    <p>8.2 在使用平台服务过程中，用户承诺遵守以下约定：</p>
                    <p>（1）在使用平台的服务过程中实施的所有行为均遵守国家法律、法规等规范文件及平台的各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。如果违反前述承诺，产生任何法律后果的，用户应以自己的名义独立承担所有的法律责任，并确保平台免于因此产生任何损失。</p>
                    <p>（2）不对平台上的任何数据或信息作商业性利用，包括但不限于在未经平台事先书面同意的情况下，以复制、传播等任何方式使用，或许可、泄露给任何第三方使用，或者为任何第三方使用提供便利。</p>
                    <p>（3）不使用任何装置、软件或例行程序干预或试图干预平台的正常运作或正在平台上进行的任何活动。用户不得采取任何将导致不合理的庞大数据负载加诸平台网络设备的行动。</p>
                    <p>（4）不得发表、传送、传播、储存侵害他人知识产权、商业秘密权等合法权利的内容或包含病毒、木马、定时炸弹等可能对服务系统造成伤害或影响其稳定性的内容。</p>
                    <p>（5）不得进行危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器帐号；不得未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；不得未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其它实施破坏网络安全的行为；不得企图干涉、破坏本平台系统或手机APP的正常运行。</p>
                    <p>（6）不得发布任何有损平台商誉的言论。</p>
                    <p>（7）本平台将保留因用户违反法律法规而导致与用户利益损失的追诉权。同时，因用户违反法律法规造成严重损失或恶劣社会影响的，对平台造成损失的，平台有权向用户追偿。</p>
                    <p>8.3 用户理解并同意：</p>
                    <p>（1）违反上述承诺时，平台有权依据本协议的约定，做出相应处理或终止提供服务，且无须征得用户的同意或提前通知用户。</p>
                    <p>（2）根据相关法律的指定或者平台服务规则的判断，用户的行为涉嫌违反法律法规的规定或违反本协议和/或规则的条款，平台有权采取相应措施，包括但不限于直接屏蔽、删除侵权信息、降低信用值或直接停止提供服务，直至注销账户。</p>
                    <p>（3）对于用户在平台上实施的行为，包括未在平台上实施但已经对平台及其用户产生影响的行为，平台有权单方认定该行为的性质及是否构成对本协议和/或规则的违反，并据此采取相应的必要的处理措施。</p>
                    <p>（4）对于用户涉嫌违反承诺的行为对任意第三方造成损害的，用户均应当以自己的名义独立承担所有的法律责任，并应确保平台免于承担因此产生的损失或增加的费用。</p>
                    <p>（5）如用户涉嫌违反有关法律或者本协议之规定，使平台遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，用户应当赔偿平台因此造成的损失及发生的费用，包括但不限于合理的律师费用。</p>
                    <p> 8.4 用户因使用平台而获取的收益，应当自行依法缴纳相关税费。</p>
                    <p>第九条 法律管辖和适用</p>
                    <p>9.1 本条款的订立、执行和解释及争议的解决均应适用中国法律。</p>
                    <p>9.2 本协议签订地为中华人民共和国成都市。</p>
                    <p>9.3 如双方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均有权向法院提起诉讼。</p>
                    <p>9.4本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
                    <p> 9.5本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>
                </Modal>
                <Modal
                    visible={this.state.consultant}
                    bodyStyle={{height:'600px',overflow:'scroll'}}
                    style={{height:'600px'}}
                    forceRender={true}
                    width={900}
                    destroyOnClose={true}
                    onCancel={() => { this.setState({consultant: false }) }}
                    footer={''}>
                    <p className='title'>e站房屋平台置业顾问注册协议</p>
                    <p>e站房屋平台（以下简称“我们”或者“平台”）所提供的各项服务的所有权和运营权，均归属于成都叁城房地产经纪有限公司及其关联主体。<b>置业顾问在平台注册，即表示接受本协议的所有条件和条款。置业顾问部分或全部不接受本协议条款的，不得使用平台；在平台注册成功或使用平台服务的，视为完全知晓且同意注册协议的所有条款。</b> 注册协议（以下简称“本协议”）系置业顾问因使用平台的各项服务而与平台订立的正式的、完整的协议。本协议内容同时包括平台可能不断发布或更新的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，置业顾问应当及时查看本协议更新内容，若有异议的应当注销本平台账户，若未有异议且继续使用平台服务的，视为接受本协议的更新内容。</p>
                    <p>第一条 定义</p>
                    <p>1.1 e站房屋平台：指e站房屋网站（域名：ezhanhome.com）及e站房屋客户端、小程序等互联网端口。旨在为置业顾问发布最新房源信息、信息浏览与查询、交易撮合与处理、争议调解等互联网信息服务和在线交易处理服务的网络平台。平台仅为开发商、置业顾问与客户之间的交易提供网络信息服务支持，若双方因合同履行发生争议的，应当根据合同相对性原则自行协商处理或寻求平台调解争议。</p>
                    <p>1.2 置业顾问，是指获得了相关资质、授权等手续从而在平台发布信息的人。本协议项下，特指已经登录或下载平台，并自愿申请注册，注册成功且将相关房源发布在平台的具有相关资质的法人、具有完全民事行为能力和责任能力的个人或法律认可的其他组织，置业顾问应当具备相应的资质证照。置业顾问可根据情况对其相关房源信息进行发布，但不得违反国家法律法规及开发商的相关规定。原则上，平台对此不进行干涉。</p>
                    <p>1.3 订单 指房源的详细信息，包括但不限于地理位置、价格、户型、容积率、梯户比、学区、医疗、交通。</p>
                    <p>1.4 发单（发布订单），是指置业顾问将订单信息发布在平台上，供选择的要约邀请信息。</p>
                    <p>第二条 服务条款的确认和接受</p>
                    <p>2.1 置业顾问应在使用平台的服务之前认真阅读本协议及相关业务规则内容。如对协议有任何疑问的，应于注册前向平台客服咨询。<b>但无论置业顾问事实上是否在使用平台的服务之前认真阅读了本协议内容，只要置业顾问使用平台的服务，则本协议即对置业顾问产生约束，届时置业顾问不应以未阅读本协议的内容或者未获得平台客服对问询的解答等理由，主张本协议无效，或要求撤销本协议。</b></p>
                    <p>2.2 置业顾问注册前应认真阅读本协议内容及平台规则，置业顾问在平台完成注册程序，成为平台置业顾问，即视为置业顾问完全同意本协议所有服务条款及平台相关规则。在置业顾问按照注册页面提示填写信息、阅读并同意本协议，并完成全部注册程序后，或以平台允许的其他方式实际使用了平台的服务的，即视为置业顾问同意本协议全部条款并受其约束。</p>
                    <p>2.3 置业顾问确认其有条件、有资质注册和使用平台。置业顾问注册平台、发布订单、完成订单不违反任何法律或合同约定的义务（包括但不限于竞业限制义务、保密义务等）。如果不具备前述条件或资格的，经核实后，平台有权冻结或注销该置业顾问的账户；由此给平台造成损失的，置业顾问应当赔偿平台的全部损失（包括但不限于赔偿金、补偿金、罚金以及诉讼费、调查费及律师费等）。</p>
                    <p>2.4 置业顾问应当保证注册时提供的信息的完整性、真实性、合法性。平台有权根据业务需要，随时审核置业顾问的注册信息是否完整真实有效，一旦发现置业顾问信息存在不真实情况的或不符合平台业务规则的，平台有权冻结或注销该置业顾问的账户。</p>
                    <p>2.5 置业顾问承诺订单一经生效，即应如约完整履行。</p>
                    <p>2.6 根据业务需要，平台保留在国家法律允许及本协议约定的范围内，独自决定拒绝服务、中止服务、终止服务或注销置业顾问账户的权利。</p>
                    <p>2.7 根据业务需要，平台保留在国家法律允许的范围内，不时地制订、修改本协议或业务规则，并以网站或者手机APP公示的方式进行公示。<b>如置业顾问继续使用平台的服务的，即表示置业顾问接受经修订的协议和规则。</b></p>
                    <p>2.8 为了保证平台服务的安全性和功能的一致性，平台有权不经向置业顾问特别通知而对应用进行更新，对平台的部分功能效果进行改变或限制。新版本发布后，平台不保证旧版本继续可用及相应的客户服务，置业顾问应随时核对并下载最新版本。</p>
                    <p>第三条 平台服务内容</p>
                    <p>3.1 平台可能为不同的终端设备开发了不同的应用程序版本，置业顾问应当根据实际情况选择下载合适的版本进行安装。平台不保证所有的版本与相关设备的适配性和可用性，亦不保证所有的版本提供的服务的一致性。</p>
                    <p>3.2 平台提供的服务为：提供信息管理、信息浏览与查询、交易撮合与处理、订单查询与管理、争议调解等互联网信息服务和在线交易处理服务的网络平台。具体以平台届时有效的服务内容为准。</p>
                    <p>3.3 尽管平台尽力保证服务的有效性和可用性，但因电信故障、黑客攻击或政策变动等不可抗力因素，可能导致前述服务部分或全部无效或调整，置业顾问理解并接受该等情形的出现，并放弃因此向平台索赔的权利。</p>
                    <p>3.4 置业顾问必须自行准备如下服务设备，并承担相关服务开支：</p>
                    <p>（1）服务设备，手机。</p>
                    <p>（2）服务开支，包括并不限于网络流量费、结算手续费，以及履行服务过程可能发生的其他费用等。</p>
                    <p>3.5 置业顾问使用平台服务而需要下载相关客户端程序时，平台给予置业顾问一项单个的、不可转让及非排他性的许可。置业顾问仅在使用平台服务时使用相关客户端程序，不进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现相关客户端程序的源代码；不得删除相关客户端程序及其副本上关于著作权的信息。置业顾问终止使用平台服务时，应当立即删除相关客户端程序及其数据。</p>
                    <p>3.6本条及本协议其他条款未明示授权的其他一切权利仍由平台保留，置业顾问在行使这些权利时须提前取得平台的书面许可。平台未行使前述任何权利的，并不构成对该权利的放弃。</p>
                    <p>第四条 账户管理</p>
                    <p> 4.1 置业顾问账户的所有权归平台所有，置业顾问完成申请注册手续后，仅获得置业顾问帐号的使用权，且该使用权仅属于初始申请注册人，申请注册人应对该置业顾问账号行为负责。<b>申请注册人不得将账户借/租/送给他人使用，否则申请注册人应承担由此产生的全部责任，并与实际使用人承担不可撤销的连带责任。一经发现，平台有权注销此类置业顾问账户。</b></p>
                    <p>4.2 置业顾问注册成功后，将生成由置业顾问自行设置的置业顾问名和密码等账户信息。置业顾问可以根据平台的业务规则改变密码。置业顾问应谨慎合理的保存、使用其置业顾问名和密码，并对利用置业顾问的置业顾问名和密码完成管理权限验证而实施的所有行为、活动及事件负全责。置业顾问若发现任何不当使用置业顾问账号或存在安全漏洞等其他可能危及置业顾问账户安全的情况，应当立即以有效方式通知平台，要求平台暂停相关服务，并向公安机关报案。</p>
                    <p>4.3 置业顾问依据4.2条发出的通知<b>至少应当包括情况描述，相关的初步证据，要求平台处理措施，通知人联系信息等，缺乏前述信息的通知视为无效通知。</b>置业顾问理解平台对置业顾问的通知请求识别、采取行动需要合理时间，平台对在采取行动前已经产生的后果（包括但不限于置业顾问已产生或不可避免的经济损失、名誉损失）及非因平台原因产生的后果不承担任何责任。   </p>
                    <p>4.4 置业顾问理解并同意，平台有权使用置业顾问的注册信息，登陆进入置业顾问的注册账户，进行证据保全，包括但不限于公证、见证；同时，为了更好的为置业顾问提供服务，平台及其关联方可以无偿的、商业性的分析和使用置业顾问注册信息及使用数据。</p>
                    <p>4.5 置业顾问注册帐号后如果长期不登录该帐号，平台有权回收、注销该帐号，以免造成资源浪费，由此带来的任何损失均由置业顾问自行承担。</p>
                    <p>4.6 置业顾问理解并同意，<b>平台通过向置业顾问注册时预留的地址、电话、邮箱等任一方式发送信息，或者通过平台发送站内信息，即视为平台向置业顾问履行了送达、通知义务。</b></p>
                    <p>4.7 所有违反协议约定或者平台规则的行为，平台都有权根据违规情节和性质进行相应的处理，直至封禁账号（拉黑）处理，违规情节和性质由平台依据相关法律或平台规则或双方事先约定最终确定。平台不可能事先列举所有违规事项和处理措施，对未事先列举的，由平台依据诚实信用原则或公序良俗原则予以确定。被封禁（拉黑）的账号内剩余的所有资产都将作为违约金或损害赔偿给到平台或由平台转赔偿真正的受损害方。</p>
                    <p><b>第五条 责任范围与责任限制（重要）</b></p>
                    <p>5.1 置业顾问理解并同意，置业顾问提供服务的合同相对方是购房者，合同履行的瑕疵担保及付款责任应当由根据双方约定的内容承担，作为交易信息平台的平台，与购房者是独立的商事主体，不为购房者承担任何担保或连带责任。</p>
                    <p>5.2 置业顾问在履行合同之前，应当自行审核购房者的真实性及履约能力，作为交易信息平台的平台，不承担任何担保或连带责任。特别地，平台作为交易信息平台，无法控制每一订单所涉及的安全或合法性，以及交易的真实性或准确性。置业顾问因完成订单遭受人身损害、财产损害的，或造成第三方人身损害、财产损害的，应当依法向责任主体追究法律责任，平台不承担任何责任。</p>
                    <p>5.3 有且仅当法律法规明确要求，或出现以下情况，平台才对置业顾问注册信息、订单信息进行事先或事后的审查：</p>
                    <p style={{textIndent:0}}>（1）应其他用户或置业顾问的要求，且有合理的理由认为特定置业顾问的交易可能存在重大违法或违约情形。</p>
                    <p style={{textIndent:0}}>（2）应其他用户或置业顾问的要求，且有合理理由认为置业顾问在平台的行为涉嫌违法或不当。 置业顾问理解并同意并积极配合平台审查行为，平台可自行决定审查终结时间，审查终结前，平台可按相关规则对置业顾问、置业顾问账号、数据进行审查，包括但不限于暂扣、冻结等。</p>
                    <p>5.4 如因不可抗力或其他平台无法控制的原因使平台系统崩溃或无法正常使用，从而导致交易无法完成或丢失有关的信息、记录等，平台不承担责任。平台会尽可能合理地协助处理善后事宜，并努力使置业顾问免受或减少经济损失。</p>
                    <p>5.5 置业顾问同意在发现平台任何内容不符合法律规定，或不符合本协议规定的，有义务及时通知平台。如果置业顾问发现合法权利受到侵害，请将此情况告知平台并同时提供如下信息和材料：</p>
                    <p style={{textIndent:0}}>（1）侵犯置业顾问权利的信息的网址，编号或其他可以找到该信息的细节；</p>
                    <p style={{textIndent:0}}>（2）置业顾问的联系方式，包括联系人姓名，地址，电话号码和电子邮件；</p>
                    <p style={{textIndent:0}}>（3）置业顾问的身份证复印件、营业执照等其他相关资料；</p>
                    <p style={{textIndent:0}}>（4）平台要求提供的其他相关材料。</p>
                    <p>经审查得到证实的，平台将及时删除相关信息。</p>
                    <p>5.6 置业顾问应当严格遵守本协议及平台发布的其他协议、活动规则，因置业顾问违反协议或规则的行为给第三方或平台造成损失的，置业顾问应当承担全部责任，平台因此承担责任的，有权向置业顾问追偿。</p>
                    <p>5.7 置业顾问理解并同意，平台可能会与第三方合作向置业顾问提供相关的服务（包括但不限于广告服务、支付服务、寻址定位服务、售后服务），在此情况下，平台不保证该第三方提供的服务的可用性、有效性和合法性。</p>
                    <p>5.8 置业顾问与平台并非劳动、劳务、雇佣关系。任何时候，置业顾问自平台获取的收益（若有），不应当视为工资、薪金及劳务报酬或类似收入。置业顾问应自行购买相应保险，并自行承担履行义务过程中的意外事故或责任事故的责任及损失。</p>
                    <p>5.9 平台在本协议中仅为置业顾问提供发布信息的平台，除本协议约定应由平台承担的义务外，置业顾问与购房者达成的具体业务及过程中产生的全部权利义务，包括但不限于房屋价款、价款支付方式与时间、交付于过户，由双方自行承担，与平台无关。如因双方合同义务履行不当给平台造成任何损失的，平台有权向责任人追偿。</p>
                    <p>第六条 对置业顾问信息的存储和限制</p>
                    <p>6.1 平台不对置业顾问所保留的信息的删除或储存失败负责，置业顾问应当自行备份置业顾问信息及使用数据。</p>
                    <p>6.2 置业顾问账户被注销后，平台没有义务为其保留或向其披露其账户中的任何信息，也没有义务向置业顾问或第三方转发任何置业顾问未曾阅读或发送过的信息。</p>
                    <p>6.3 置业顾问理解并同意，与平台的协议关系终止后，平台仍享有下列权利：</p>
                    <p>（1）继续保存置业顾问未及时删除的注册信息及使用平台的服务期间发布的所有信息的权利，直至法律规定的记录保存期满。</p>
                    <p>（2）置业顾问在使用平台的服务期间存在违法行为或违反本协议和/或规则的行为的，平台仍可依据本协议向置业顾问主张权利。</p>
                    <p>（3）要求置业顾问根据本协议承担保密义务而无需支付任何费用的权利。</p>
                    <p>第七条 信息与数据所有权</p>
                    <p>7.1 平台各项信息服务及其载体，以及交易处理数据的所有权和运营权归成都叁城房地产经纪有限公司，平台可依自身义务需要采取任何商业性利用或开发。</p>
                    <p>7.2 平台服务内容的方式包括：文字、软件、声音、图片、录像、图表、广告中的全部内容；电子邮件的全部内容；平台为置业顾问提供的其他信息。所有这些内容受版权、商标、标签和其它法律的保护。置业顾问可在在平台和开发商的书面授权下使用这些内容，作为其宣传营销手段，若因置业顾问未取得相关授权从而导致侵权的，置业顾问应承担全部责任，若因此导致平台承担责任的，平台有权向置业顾问追偿（包括但不限于平台已赔偿的费用、资金占用利息、律师费、公证费、差旅费、诉讼费）。平台所有的文章版权归原文作者和平台共同所有，任何人需要转载该等文章或信息，必须征得原文作者或平台书面授权。</p>
                    <p>7.3 <b>置业顾问接受本协议条款，即表明该置业顾问将其在平台发表的任何形式的信息的著作权或其他合法权利，包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利无偿独家转让给平台所有，同时表明该置业顾问许可平台有权就任何主体侵权而单独提起诉讼，并获得全部赔偿。</b>本协议效力及于置业顾问在平台发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。若因该内容侵犯第三人的著作权或其他合法权利，成都叁城房地产经纪有限公司因此遭受损害的，有权向置业顾问追偿。同时，平台保留删除站内各类不符合规定或侵权信息而不通知置业顾问的权利。</p>
                    <p>第八条 置业顾问行为规范</p>
                    <p>8.1 置业顾问须严格按照平台提供、发布、更新的服务条款和业务规则执行。平台不时发布的成文或非成文的业务规则，以及既成的交易模式或惯例，视为本协议的重要组成部分。</p>
                    <p>8.2 在使用平台服务过程中，置业顾问承诺遵守以下约定：</p>
                    <p>（1）在使用平台的服务过程中实施的所有行为均遵守国家法律、法规等规范文件及平台的各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。如果违反前述承诺，产生任何法律后果的，置业顾问应以自己的名义独立承担所有的法律责任，并确保平台免于因此产生任何损失。</p>
                    <p>（2）不对平台上的任何数据或信息作商业性利用，包括但不限于在未经平台事先书面同意的情况下，以复制、传播等任何方式使用，或许可、泄露给任何第三方使用，或者为任何第三方使用提供便利，<b>该等责任及于置业顾问与服务平台服务关系终止后三年。</b></p>
                    <p>（3）不使用任何装置、软件或例行程序干预或试图干预平台的正常运作或正在平台上进行的任何活动。置业顾问不得采取任何将导致不合理的庞大数据负载加诸平台网络设备的行动。</p>
                    <p>（4）不得发表、传送、传播、储存侵害他人知识产权、商业秘密权等合法权利的内容或包含病毒、木马、定时炸弹等可能对服务系统造成伤害或影响其稳定性的内容。</p>
                    <p>（5）不得进行危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器帐号；不得未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；不得未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其它实施破坏网络安全的行为；不得企图干涉、破坏本平台系统或手机APP的正常运行。</p>
                    <p>（6）不得发布任何有损平台商誉的言论。</p>
                    <p>（7）本平台将保留因置业顾问违反法律法规而导致与置业顾问利益损失的追诉权。同时，因置业顾问违反法律法规造成严重损失或恶劣社会影响的，对平台造成损失的，平台有权向置业顾问追偿。</p>
                    <p>8.3 置业顾问理解并同意：</p>
                    <p>（1）违反上述承诺时，平台有权依据本协议的约定，做出相应处理或终止提供服务，且无须征得置业顾问的同意或提前通知置业顾问。</p>
                    <p>（2）根据相关法令的指定或者平台服务规则的判断，置业顾问的行为涉嫌违反法律法规的规定或违反本协议和/或规则的条款，平台有权采取相应措施，包括但不限于直接屏蔽、删除侵权信息、降低信用值或直接停止提供服务，直至注销账户。</p>
                    <p>（3）对于置业顾问在平台上实施的行为，包括未在平台上实施但已经对平台及其用户或其他置业顾问产生影响的行为，平台有权单方认定该行为的性质及是否构成对本协议和/或规则的违反，并据此采取相应的必要的处理措施。</p>
                    <p>（4）对于置业顾问涉嫌违反承诺的行为对任意第三方造成损害的，置业顾问均应当以自己的名义独立承担所有的法律责任，并应确保平台免于承担因此产生的损失或增加的费用。</p>
                    <p>（5）如置业顾问涉嫌违反有关法律或者本协议之规定，使平台遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，置业顾问应当赔偿平台因此造成的损失及发生的费用，包括但不限于合理的律师费用。</p>
                    <p>8.4 置业顾问因使用平台而获取的收益，应当自行依法缴纳相关税费。</p>
                    <p>第九条 法律管辖和适用</p>
                    <p>9.1 本条款的订立、执行和解释及争议的解决均应适用中国法律。</p>
                    <p>9.2 本协议签订地为中华人民共和国成都市。</p>
                    <p>9.3 如双方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均有权向法院提起诉讼。</p>
                    <p>9.4本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
                    <p>9.5本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>
                </Modal>
                <Modal
                    visible={this.state.agent}
                    bodyStyle={{height:'600px',overflow:'scroll'}}
                    style={{height:'600px'}}
                    forceRender={true}
                    width={900}
                    destroyOnClose={true}
                    onCancel={() => { this.setState({agent: false }) }}
                    footer={''}>
                    <p className='title'>e站房屋平台经纪人注册协议</p>
                    <p>e站房屋平台（以下简称“我们”或者“平台”）所提供的各项服务的所有权和运营权，均归属于成都叁城房地产经纪有限公司及其关联主体。<b>经纪人在平台注册，即表示接受本协议的所有条件和条款。经纪人部分或全部不接受本协议条款的，不得使用平台；在平台注册成功或使用平台服务的，视为完全知晓且同意注册协议的所有条款。</b> 注册协议（以下简称“本协议”）系经纪人因使用平台的各项服务而与平台订立的正式的、完整的协议。本协议内容同时包括平台可能不断发布或更新的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，经纪人应当及时查看本协议更新内容，若有异议的应当注销本平台账户，若未有异议且继续使用平台服务的，视为接受本协议的更新内容。</p>
                    <p>第一条 定义</p>
                    <p>1.1 e站房屋平台：指e站房屋网站（域名：ezhanhome.com）及e站房屋客户端、小程序等互联网端口。旨在为经纪人发布最新房源信息、信息浏览与查询、交易撮合与处理、争议调解等互联网信息服务和在线交易处理服务的网络平台。平台仅为开发商、经纪人与客户之间的交易提供网络信息服务支持，若双方因合同履行发生争议的，应当根据合同相对性原则自行协商处理或寻求平台调解争议。</p>
                    <p>1.2 经纪人，是指获得了相关资质、授权等手续从而在平台发布信息的人。本协议项下，特指已经登录或下载平台，并自愿申请注册，注册成功且将相关房源发布在平台的具有相关资质的法人、具有完全民事行为能力和责任能力的个人或法律认可的其他组织，经纪人应当具备相应的资质证照。经纪人可根据情况对其相关房源信息进行发布，但不得违反国家法律法规及开发商的相关规定。原则上，平台对此不进行干涉。</p>
                    <p>1.3 订单 指房源的详细信息，包括但不限于地理位置、价格、户型、容积率、梯户比、学区、医疗、交通。</p>
                    <p>1.4 发单（发布订单），是指经纪人将订单信息发布在平台上，供选择的要约邀请信息。</p>
                    <p>第二条 服务条款的确认和接受</p>
                    <p>2.1 经纪人应在使用平台的服务之前认真阅读本协议及相关业务规则内容。如对协议有任何疑问的，应于注册前向平台客服咨询。<b>但无论经纪人事实上是否在使用平台的服务之前认真阅读了本协议内容，只要经纪人使用平台的服务，则本协议即对经纪人产生约束，届时经纪人不应以未阅读本协议的内容或者未获得平台客服对问询的解答等理由，主张本协议无效，或要求撤销本协议。</b></p>
                    <p>2.2 经纪人注册前应认真阅读本协议内容及平台规则，经纪人在平台完成注册程序，成为平台经纪人，即视为经纪人完全同意本协议所有服务条款及平台相关规则。在经纪人按照注册页面提示填写信息、阅读并同意本协议，并完成全部注册程序后，或以平台允许的其他方式实际使用了平台的服务的，即视为经纪人同意本协议全部条款并受其约束。</p>
                    <p>2.3 经纪人确认其有条件、有资质注册和使用平台。经纪人注册平台、发布订单、完成订单不违反任何法律或合同约定的义务（包括但不限于竞业限制义务、保密义务等）。如果不具备前述条件或资格的，经核实后，平台有权冻结或注销该经纪人的账户；由此给平台造成损失的，经纪人应当赔偿平台的全部损失（包括但不限于赔偿金、补偿金、罚金以及诉讼费、调查费及律师费等）。</p>
                    <p>2.4 经纪人应当保证注册时提供的信息的完整性、真实性、合法性。平台有权根据业务需要，随时审核经纪人的注册信息是否完整真实有效，一旦发现经纪人信息存在不真实情况的或不符合平台业务规则的，平台有权冻结或注销该经纪人的账户。</p>
                    <p>2.5 经纪人承诺订单一经生效，即应如约完整履行。</p>
                    <p>2.6 根据业务需要，平台保留在国家法律允许及本协议约定的范围内，独自决定拒绝服务、中止服务、终止服务或注销经纪人账户的权利。</p>
                    <p>2.7 根据业务需要，平台保留在国家法律允许的范围内，不时地制订、修改本协议或业务规则，并以网站或者手机APP公示的方式进行公示。<b>如经纪人继续使用平台的服务的，即表示经纪人接受经修订的协议和规则。</b></p>
                    <p>2.8 为了保证平台服务的安全性和功能的一致性，平台有权不经向经纪人特别通知而对应用进行更新，对平台的部分功能效果进行改变或限制。新版本发布后，平台不保证旧版本继续可用及相应的客户服务，经纪人应随时核对并下载最新版本。</p>
                    <p>第三条 平台服务内容</p>
                    <p>3.1 平台可能为不同的终端设备开发了不同的应用程序版本，经纪人应当根据实际情况选择下载合适的版本进行安装。平台不保证所有的版本与相关设备的适配性和可用性，亦不保证所有的版本提供的服务的一致性。</p>
                    <p>3.2 平台提供的服务为：提供信息管理、信息浏览与查询、交易撮合与处理、订单查询与管理、争议调解等互联网信息服务和在线交易处理服务的网络平台。具体以平台届时有效的服务内容为准。</p>
                    <p>3.3 尽管平台尽力保证服务的有效性和可用性，但因电信故障、黑客攻击或政策变动等不可抗力因素，可能导致前述服务部分或全部无效或调整，经纪人理解并接受该等情形的出现，并放弃因此向平台索赔的权利。</p>
                    <p>3.4 经纪人必须自行准备如下服务设备，并承担相关服务开支：</p>
                    <p>（1）服务设备，手机。</p>
                    <p>（2）服务开支，包括并不限于网络流量费、结算手续费，以及履行服务过程可能发生的其他费用等。</p>
                    <p>3.5 经纪人使用平台服务而需要下载相关客户端程序时，平台给予经纪人一项单个的、不可转让及非排他性的许可。经纪人在使用平台服务时使用相关客户端程序，不进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现相关客户端程序的源代码；不得删除相关客户端程序及其副本上关于著作权的信息。经纪人止使用平台服务时，应当立即删除相关客户端程序及其数据。</p>
                    <p>3.6本条及本协议其他条款未明示授权的其他一切权利仍由平台保留，经纪人权利时须提前取得平台的书面许可。平台未行使前述任何权利的，并不构成对该权利的放弃。</p>
                    <p>第四条 账户管理</p>
                    <p> 4.1 经纪人有权归平台所有，经纪人成申请注册手续后，仅获得经纪人号的使用权，且该使用权仅属于初始申请注册人，申请注册人应对该经纪人账号行为负责。<b>申请注册人不得将账户借/租/送给他人使用，否则申请注册人应承担由此产生的全部责任，并与实际使用人承担不可撤销的连带责任。一经发现，平台有权注销此类经纪人账户。</b></p>
                    <p>4.2 经纪人注册成功后，将生成由经纪人自行设置的经纪人和密码等账户信息。经纪人可以根据平台的业务规则改变密码。经纪人谨慎合理的保存、使用其经纪人密码，并对利用经纪人经纪人和密码完成管理权限验证而实施的所有行为、活动及事件负全责。经纪人发现任何不当使用经纪人或存在安全漏洞等其他可能危及经纪人户安全的情况，应当立即以有效方式通知平台，要求平台暂停相关服务，并向公安机关报案。</p>
                    <p>4.3 经纪人条发出的通知<b>至少应当包括情况描述，相关的初步证据，要求平台处理措施，通知人联系信息等，缺乏前述信息的通知视为无效通知。</b>经纪人解平台对经纪人通知请求识别、采取行动需要合理时间，平台对在采取行动前已经产生的后果（包括但不限于经纪人产生或不可避免的经济损失、名誉损失）及非因平台原因产生的后果不承担任何责任。   </p>
                    <p>4.4 经纪人并同意，平台有权使用经纪人注册信息，登陆进入经纪人的注册账户，进行证据保全，包括但不限于公证、见证；同时，为了更好的为经纪人提供服务，平台及其关联方可以无偿的、商业性的分析和使用经纪人注册信息及使用数据。</p>
                    <p>4.5 经纪人注册帐号后如果长期不登录该帐号，平台有权回收、注销该帐号，以免造成资源浪费，由此带来的任何损失均由经纪人自行承担。</p>
                    <p>4.6 经纪人理解并同意，<b>平台通过向经纪人注册时预留的地址、电话、邮箱等任一方式发送信息，或者通过平台发送站内信息，即视为平台向经纪人履行了送达、通知义务。</b></p>
                    <p>4.7 所有违反协议约定或者平台规则的行为，平台都有权根据违规情节和性质进行相应的处理，直至封禁账号（拉黑）处理，违规情节和性质由平台依据相关法律或平台规则或双方事先约定最终确定。平台不可能事先列举所有违规事项和处理措施，对未事先列举的，由平台依据诚实信用原则或公序良俗原则予以确定。被封禁（拉黑）的账号内剩余的所有资产都将作为违约金或损害赔偿给到平台或由平台转赔偿真正的受损害方。</p>
                    <p><b>第五条 责任范围与责任限制（重要）</b></p>
                    <p>5.1 经纪人理解并同意，经纪人提供服务的合同相对方是购房者，合同履行的瑕疵担保及付款责任应当由根据双方约定的内容承担，作为交易信息平台的平台，与购房者是独立的商事主体，不为购房者承担任何担保或连带责任。</p>
                    <p>5.2 经纪人在履行合同之前，应当自行审核购房者的真实性及履约能力，作为交易信息平台的平台，不承担任何担保或连带责任。特别地，平台作为交易信息平台，无法控制每一订单所涉及的安全或合法性，以及交易的真实性或准确性。经纪人因完成订单遭受人身损害、财产损害的，或造成第三方人身损害、财产损害的，应当依法向责任主体追究法律责任，平台不承担任何责任。</p>
                    <p>5.3 有且仅当法律法规明确要求，或出现以下情况，平台才对经纪人册信息、订单信息进行事先或事后的审查：</p>
                    <p style={{textIndent:0}}>（1）应其他用户或经纪人的要求，且有合理的理由认为特定经纪人交易可能存在重大违法或违约情形。</p>
                    <p style={{textIndent:0}}>（2）应其他用户或经纪人要求，且有合理理由认为经纪人在平台的行为涉嫌违法或不当。 经纪人解并同意并积极配合平台审查行为，平台可自行决定审查终结时间，审查终结前，平台可按相关规则对经纪人经纪人账号、数据进行审查，包括但不限于暂扣、冻结等。</p>
                    <p>5.4 如因不可抗力或其他平台无法控制的原因使平台系统崩溃或无法正常使用，从而导致交易无法完成或丢失有关的信息、记录等，平台不承担责任。平台会尽可能合理地协助处理善后事宜，并努力使经纪人受或减少经济损失。</p>
                    <p>5.5 经纪人同意在发现平台任何内容不符合法律规定，或不符合本协议规定的，有义务及时通知平台。如果经纪人发现合法权利受到侵害，请将此情况告知平台并同时提供如下信息和材料：</p>
                    <p style={{textIndent:0}}>（1）侵犯经纪人权利的信息的网址，编号或其他可以找到该信息的细节；</p>
                    <p style={{textIndent:0}}>（2）经纪人的联系方式，包括联系人姓名，地址，电话号码和电子邮件；</p>
                    <p style={{textIndent:0}}>（3）经纪人的身份证复印件、营业执照等其他相关资料；</p>
                    <p style={{textIndent:0}}>（4）平台要求提供的其他相关材料。</p>
                    <p>经审查得到证实的，平台将及时删除相关信息。</p>
                    <p>5.6 经纪人应当严格遵守本协议及平台发布的其他协议、活动规则，因经纪人违反协议或规则的行为给第三方或平台造成损失的，经纪人应当承担全部责任，平台因此承担责任的，有权向经纪人追偿。</p>
                    <p>5.7 经纪人理解并同意，平台可能会与第三方合作向经纪人提供相关的服务（包括但不限于广告服务、支付服务、寻址定位服务、售后服务），在此情况下，平台不保证该第三方提供的服务的可用性、有效性和合法性。</p>
                    <p>5.8 经纪人台并非劳动、劳务、雇佣关系。任何时候，经纪人自平台获取的收益（若有），不应当视为工资、薪金及劳务报酬或类似收入。经纪人自行购买相应保险，并自行承担履行义务过程中的意外事故或责任事故的责任及损失。</p>
                    <p>5.9 平台在本协议中仅为经纪人发布信息的平台，除本协议约定应由平台承担的义务外，经纪人购房者达成的具体业务及过程中产生的全部权利义务，包括但不限于房屋价款、价款支付方式与时间、交付于过户，由双方自行承担，与平台无关。如因双方合同义务履行不当给平台造成任何损失的，平台有权向责任人追偿。</p>
                    <p>第六条 对经纪人息的存储和限制</p>
                    <p>6.1 平台不对经纪人留的信息的删除或储存失败负责，经纪人当自行备份经纪人及使用数据。</p>
                    <p>6.2 经纪人账户被注销后，平台没有义务为其保留或向其披露其账户中的任何信息，也没有义务向经纪人第三方转发任何经纪人未曾阅读或发送过的信息。</p>
                    <p>6.3 经纪人理解并同意，与平台的协议关系终止后，平台仍享有下列权利：</p>
                    <p>（1）继续保存经纪人及时删除的注册信息及使用平台的服务期间发布的所有信息的权利，直至法律规定的记录保存期满。</p>
                    <p>（2）经纪人在使用平台的服务期间存在违法行为或违反本协议和/或规则的行为的，平台仍可依据本协议向经纪人主张权利。</p>
                    <p>（3）要求经纪人根据本协议承担保密义务而无需支付任何费用的权利。</p>
                    <p>第七条 信息与数据所有权</p>
                    <p>7.1 平台各项信息服务及其载体，以及交易处理数据的所有权和运营权归成都叁城房地产经纪有限公司，平台可依自身义务需要采取任何商业性利用或开发。</p>
                    <p>7.2 平台服务内容的方式包括：文字、软件、声音、图片、录像、图表、广告中的全部内容；电子邮件的全部内容；平台为经纪人提供的其他信息。所有这些内容受版权、商标、标签和其它法律的保护。经纪人可在在平台和开发商的书面授权下使用这些内容，作为其宣传营销手段，若因经纪人取得相关授权从而导致侵权的，经纪人承担全部责任，若因此导致平台承担责任的，平台有权向经纪人追偿（包括但不限于平台已赔偿的费用、资金占用利息、律师费、公证费、差旅费、诉讼费）。平台所有的文章版权归原文作者和平台共同所有，任何人需要转载该等文章或信息，必须征得原文作者或平台书面授权。</p>
                    <p>7.3 <b>经纪人协议条款，即表明该经纪人将其在平台发表的任何形式的信息的著作权或其他合法权利，包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利无偿独家转让给平台所有，同时表明该经纪人平台有权就任何主体侵权而单独提起诉讼，并获得全部赔偿。</b>本协议效力及于经纪人平台发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。若因该内容侵犯第三人的著作权或其他合法权利，成都叁城房地产经纪有限公司因此遭受损害的，有权向经纪人追偿。同时，平台保留删除站内各类不符合规定或侵权信息而不通知经纪人权利。</p>
                    <p>第八条 经纪人行为规范</p>
                    <p>8.1 经纪人须严格按照平台提供、发布、更新的服务条款和业务规则执行。平台不时发布的成文或非成文的业务规则，以及既成的交易模式或惯例，视为本协议的重要组成部分。</p>
                    <p>8.2 在使用平台服务过程中，经纪人承诺遵守以下约定：</p>
                    <p>（1）在使用平台的服务过程中实施的所有行为均遵守国家法律、法规等规范文件及平台的各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。如果违反前述承诺，产生任何法律后果的，经纪人应以自己的名义独立承担所有的法律责任，并确保平台免于因此产生任何损失。</p>
                    <p>（2）不对平台上的任何数据或信息作商业性利用，包括但不限于在未经平台事先书面同意的情况下，以复制、传播等任何方式使用，或许可、泄露给任何第三方使用，或者为任何第三方使用提供便利，<b>该等责任及于经纪人与服务平台服务关系终止后三年。</b></p>
                    <p>（3）不使用任何装置、软件或例行程序干预或试图干预平台的正常运作或正在平台上进行的任何活动。经纪人不得采取任何将导致不合理的庞大数据负载加诸平台网络设备的行动。</p>
                    <p>（4）不得发表、传送、传播、储存侵害他人知识产权、商业秘密权等合法权利的内容或包含病毒、木马、定时炸弹等可能对服务系统造成伤害或影响其稳定性的内容。</p>
                    <p>（5）不得进行危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器帐号；不得未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；不得未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其它实施破坏网络安全的行为；不得企图干涉、破坏本平台系统或手机APP的正常运行。</p>
                    <p>（6）不得发布任何有损平台商誉的言论。</p>
                    <p>（7）本平台将保留因经纪人违反法律法规而导致与经纪人益损失的追诉权。同时，因经纪人违反法律法规造成严重损失或恶劣社会影响的，对平台造成损失的，平台有权向经纪人追偿。</p>
                    <p>8.3 经纪人理解并同意：</p>
                    <p>（1）违反上述承诺时，平台有权依据本协议的约定，做出相应处理或终止提供服务，且无须征得经纪人的同意或提前通知经纪人。</p>
                    <p>（2）根据相关法令的指定或者平台服务规则的判断，经纪人的行为涉嫌违反法律法规的规定或违反本协议和/或规则的条款，平台有权采取相应措施，包括但不限于直接屏蔽、删除侵权信息、降低信用值或直接停止提供服务，直至注销账户。</p>
                    <p>（3）对于经纪人在平台上实施的行为，包括未在平台上实施但已经对平台及其用户或其他经纪人产生影响的行为，平台有权单方认定该行为的性质及是否构成对本协议和/或规则的违反，并据此采取相应的必要的处理措施。</p>
                    <p>（4）对于经纪人涉嫌违反承诺的行为对任意第三方造成损害的，经纪人均应当以自己的名义独立承担所有的法律责任，并应确保平台免于承担因此产生的损失或增加的费用。</p>
                    <p>（5）如经纪人涉嫌违反有关法律或者本协议之规定，使平台遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，经纪人应当赔偿平台因此造成的损失及发生的费用，包括但不限于合理的律师费用。</p>
                    <p>8.4 经纪人因使用平台而获取的收益，应当自行依法缴纳相关税费。</p>
                    <p>第九条 法律管辖和适用</p>
                    <p>9.1 本条款的订立、执行和解释及争议的解决均应适用中国法律。</p>
                    <p>9.2 本协议签订地为中华人民共和国成都市。</p>
                    <p>9.3 如双方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均有权向法院提起诉讼。</p>
                    <p>9.4本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
                    <p>9.5本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>
                </Modal>
                <Modal
                    visible={this.state.statement}
                    forceRender={true}
                    width={900}
                    destroyOnClose={true}
                    onCancel={() => { this.setState({ statement: false }) }}
                    footer={''}>
                    <p className='title'>隐私条款及免责声明</p>
                    <p className='userN'>尊敬的e站房屋用户：</p>
                    <p>e站房屋平台（以下亦称“e站”或“我们”）非常重视客户个人信息及隐私权的保护，因此我们制订了涵盖如何收集、存储、使用、共享和保护客户信息的隐私政策。</p>
                    <p>e站房屋平台系指包含新房管理中心、经纪人服务板块、购房者服务板块等集合而成的综合系统。</p>
                    <p><b>请仔细阅读本隐私政策的全部条款（尤其是以加粗方式显示的内容），确认您已完全了解我们对您个人信息的处理规则，并作出您认为适当的选择。阅读过程中，如您有任何疑问，可跟我们的客服咨询及确认，如您不同意协议中的任何条款，您应立即停止访问或使用e站房屋平台。</b></p>
                    <p><b>第一部分定义</b></p>
                    <p>第二条 服务条款的确认和接受</p>
                    <p>e站房屋平台：指e站房屋网站（域名：ezhanhome.com）及e站房屋客户端、小程序等互联网端口。</p>
                    <p>e站房屋平台服务提供者：指e站房屋平台的互联网信息及软件技术服务提供者成都叁城房地产经纪有限公司及其关联主体。</p>
                    <p>个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。</p>
                    <p><b>个人隐私信息：指包括身份证件号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息、14岁以下（含）儿童信息等的个人信息。</b></p>
                    <p>个人信息删除：指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。</p>
                    <p><b>第二部分  本隐私政策将帮助您了解以下内容：</b></p>
                    <p><b>一、信息的收集和使用</b></p>
                    <p><b>为本隐私政策之目的，个人信息包括但不限于（其中，个人隐私信息以加粗方式显示）：</b>基本信息（包括个人姓名、生日、性别、住址、个人电话号码、手机号码、电子邮箱、微信号码）；<b>个人身份信息（包括身份证、护照、驾驶证等其他能显示个人信息的证件）;面部特征；</b>网络身份标识信息<b>（包括电子签名、系统账户、账户名、账户昵称、IP地址、邮箱地址及与前述有关的密码、口令、口令保护答案等）;个人财产信息（产权信息、交易信息）；其他信息（包括通讯录信息、网页浏览记录、精准定位信息）。</b></p>
                    <p>在您使用我们的产品及/或服务时，我们需要/可能需要收集和使用的您的个人信息包括如下两种：</p>
                    <p style={{ textIndent: 0 }}><b>1、为实现向您提供我们产品及/或服务的基本功能，您须授权我们收集、使用的必要的信息。如您拒绝提供相应信息，您将无法正常使用我们的产品及/或服务。我们的基本业务功能，包括注册用户服务、实现信息捜索和展示、交易及交易订单管理、客服及争议解决、保障交易安全所必须的功能；></b></p>
                    <p style={{ textIndent: 0 }}><b>2、为实现向您提供我们产品及/或服务的附加功能，您可选择授权我们收集、使用的信息。如您拒绝提供，您将无法正常使用相关附加功能或无法达到我们拟达到的功能效果，但并不会影响您正常使用我们产品及/或服务的基本功能。您理解并同意：</b></p>
                    <p style={{ textIndent: 0 }}><b>1、我们致力于打造多样的产品和服务以满足您的需求。因我们向您提供的产品和服务种类众多，且不同用户选择使用的具体产品/服务范围存在差异，相应地，基本/附加功能及收集使用的个人信息类型、范围等会有所区别， 请以具体的产品/服务功能为准；</b></p>
                    <p style={{ textIndent: 0 }}><b>2、为给您带来更好的产品和服务体验，我们在持续努力改进我们的技术，随之我们可能会不时推出新的或优化后的功能，可能需要收集、使用新的个人信息或变更个人信息使用目的或方式。对此，我们将通过更新本隐私政策、以弹窗、页面提示等方式另行向您说明对应信息的收集目的、范围及使用方式，并为您提供自主选择同意的方式，且在征得您明示同意后收集、使用。</b></p>
                    <p>在此过程中，如果您有任何疑问、意见或建议的，您可通过e站房屋平台与我们联系，我们会尽快为您作出解答。</p>
                    <p>为本隐私政策之目的，我们仅会出于以下核心业务功能，收集和使用您的个人信息，如果您不提供相关信息，您将无法享受我们提供的产品和/或服务：</p>
                    <p style={{ textIndent: 0 }}><b>(一)帮助您成为我们的注册用户</b></p>
                    <p style={{ textIndent: 0 }}>1、基础用户服务</p>
                    <p>我们通过e站房屋平台账户为您提供基础用户服务。为注册成为用户并使用我们的基础服务，您需要提供拟使用的用户名和密码用于创建账户。</p>
                    <p>对于需要通过e站房屋平台用户账户才能使用的服务，我们可能会根据您提供的上述信息校验您的用户身份，确保我们是在为您本人提供服务。</p>
                    <p>如您选择短信验证码方式登陆，您授权同意我们调用您的短信接收和处理功能，向您发送短信以验证您的身份。</p>
                    <p style={{ textIndent: 0 }}>2、	附加用户服务</p>
                    <p>实人认证:您可以根据认证要求向我们提供相应的身份信息(身份证、护照、户口本及其应的<b>身份信息（身份证、护照、户口本及其他 身份证件信息）、生物识别特征（静态或动态的面部特征）</b>以完成实人认证。</p>
                    <p>实名认证：您可以根据认证要求向我们提供相应的<b>身份信息（身份证、护照、户口本及其他身份证件信息）、银行卡信息</b>以完成实名认证。</p>
                    <p style={{ textIndent: 0 }}>3、账户信息展示：如果您已拥有e站房屋平台账户，我们可能会在e站房屋平台服务中有选择地显示您的上述个人信息（实人认证实名认证仅显示认证是否通过的结果），以及您在e站房屋平台上执行的操作，包括通过e站房屋平台账户集中展示您的个人资料、<b>交易订单</b>。我们会尊重您对e站房屋平台服务和e站房屋平台账户设置所做的选择。</p>
                    <p style={{ textIndent: 0 }}>（二）实现信息捜索和展示所必须的功能</p>
                    <p>在您使用我们服务过程中，为识别账户异常状态、了解产品适配性、向您提供更契合您需求的页面展示和搜索结果、改进和优化前述功能，我们可能会自动收集您的使用情况并存储为网络日志信息，包括：</p>
                    <p>设备信息：我们会根据您在软件安装及/或使用中的具体操作，接收并记录您所使用的设备相关信息（包括设备型号、操作系统版本、设备设置、设备环境等软硬件特征信息）、设备所在位置相关信息（包括您授权的GPS位置以及WLAN接入点、蓝牙和基站等传感器信息）。</p>
                    <p>服务日志信息：当您使用我们的网站或客户端提供的产品或服务时，我们会自动收集您对我们服务的详细使用情况，作为服务日志保存，包括浏览、点击查看、搜索查询、收藏、看房记录、交易、售后、关注分享信息、发布信息，以及IP地址、浏览器类型、电信运营商、 使用语言、访问日期和时间。</p>
                    <p><b>请您注意，如您的捜索关键词信息无法识别您的身份，其将不属于您的个人信息，我们有权在法律法规允许的范围内对其进行自主使用；只有当您的捜索关键词信息单独或与您的其他信息相互结合使用并可以识别您的身份时，则在单独或结合使用期间，我们会将您的捜索关键词信息作为您的个人信息，与您的捜索历史记录一同按照本隐私政策对其进行处理与保护。</b></p>
                    <p><b>为向您提供更便捷、更符合您个性化需求的信息展示、捜索及推送服务，我们会根据您的设备信息和服务日志信息，提取您的偏好特征，并展示、推送信息和可能的商业广告。</b></p>
                    <p>如果您不想接受我们给您发送的商业广告，您可通过短信提示回复退订或我们提供的其他方式进行退订或关闭。在您使用我们提供的站内搜索服务时，我们也同时提供了不针对您个人特征的选项。</p>
                    <p style={{ textIndent: 0 }}>（三）客户服务及争议处理</p>
                    <p>当您需要我们提供客户服务时，我们的客服会使用您的相关信息，账户信息和订单信息。</p>
                    <p>为保证您的账户安全，我们的客服会使用您的账户信息对您的身份进行核验。待您的身份核验后，我们将会查询您的订单信息。您有可能会在与我们的客服人员沟通时，提供给出上述信息外的其他信息，如当您要求我们变更联系人或联系电话。</p>
                    <p>为保障您的合法权益，保证我们的客户服务合法合规，并持续改进我们的服务能力，我们会对您与客服沟通的过程进行录音或文字留存，该留存信息仅会在法律所允许的期限和范围内予以留存和处理，并仅在基于您的维权需要、政府部门及司法部门的调查指令需要提供时，我们会进行必要披露。</p>
                    <p>为了提供服务及改进服务质量的合理需要，我们还可能使用的您的其他信息，包括您与客服联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息。</p>
                    <p style={{ textIndent: 0 }}><b>（四）保障交易安全所必须的功能 </b></p>
                    <p>为提高您使用我们的产品与/或服务时系统的安全性，更准确地预防钓鱼网站欺诈和保护账户安全，我们可能会通过了解您的订单信息、设备信息（如设备型号、设备识别码、设备标识符）、您的网络使用习惯（如浏览信息、常用软件信息）等手段来判断您的账户风险，并可能会记录一些我们认为有风险的链接。</p>
                    <p style={{ textIndent: 0 }}><b>（五）您可选择是否授权我们收集和使用您的个人信息的情形</b></p>
                    <p style={{ textIndent: 0 }}>1、为使您使用e站房屋平台更便捷或更有乐趣,从而提升您在e站房屋的体验，我们的以下附加功能中可能会收集和使用您的个人信息。这些附加功能包括：</p>
                    <p>（1）个性化推荐功能：我们可能会收集您的订单信息、看房记录、浏览信息、您设备的位置信息、您向e站房屋提供的兴趣爱好进行数据分析以形成用户画像，用来将您感兴趣的房源、商品或服务信息展示给您；或在您捜索时向您展示您可能希望找到的商品。我们会收集您的位置信息来判断您所处的地点，自动为您推荐您所在区域可以浏览的房源、可购买的商品或服务。</p>
                    <p>（2）基于摄像头(相机)的附加功能：您可以使用这个附加功能完成视频拍摄、拍照、扫码。</p>
                    <p>（3）基于图片上传的附加功能：您可以上传您的照片来实现晒单及评价功能，我们会使用您所上传的照片来识别您需要的房源、会使用您所上传的照片来识别您需要的房源、商品或使用包含您所上传图片的评价。</p>
                    <p>（4）基于语音技术的附加功能：您可以直接使用麦克风来与我们的客服机器人进行咨询和互动。在这些功能中我们会处理您的录音内容，以识别您需求和客服与售后需求。</p>
                    <p>（5）基于通讯录信息的附加功能：在获得您授权同意的前提下，我们将收集您的通讯录信息，以方便您在使用e站房屋平台服务时不再手动输入您通讯录中联系人的信息；为了增加您在 e站房屋的社交乐趣，在获得您的同意后我们也可以判断您的联系人是否也同为e站房屋用户，并在 e站房屋平台上为你们的交流提供便利。</p>
                    <p>（6）基于发送短信的附加功能：您可以将优质房源信息通过短信、微信等第三方通讯工具发送给您的好友。</p>
                    <p>（7）改进我们的产品与/或服务：为了提供服务及改进服务质量的合理需要，我们可能会获得您的其他信息，包括您与客服联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息。</p>
                    <p style={{ textIndent: 0 }}>2、上述附加功能可能需要您在您的设备中向我们开启您的地理位置（位置信息）、相机（摄像头）、相册（图片库）、麦克风以及通讯录的访问权限，以实现这些功能所涉及的信息的收集和使用。您可以在e站房屋平台通过"账户设置-设置-隐私”中逐项查看您上述权限的开启状态，并可以决定将这些权限随时的开启或关闭。<b>请您注意，您开启这些权限即代表您授权我们可以收集和使用这些个人信息来实现上述的功能，您关闭权限即代表您取消了这些授权，则我们将不再继续收集和使用您的这些个人信息，也无法为您提供上述与这些授权所对应的功能。您关闭权限的决定不会影 响此前基于您的授权所进行的个人信息的处理。</b></p>
                    <p style={{ textIndent: 0 }}><b>（六）您充分知晓，以下情形中，我们收集、使用个人信息可能无需征得您的授权同意：</b></p>
                    <p style={{ textIndent: 0 }}>1、与国家安全、国防安全直接相关的；</p>
                    <p style={{ textIndent: 0 }}>2、与公共安全、公共卫生、重大公共利益直接相关的；</p>
                    <p style={{ textIndent: 0 }}>3、与犯罪侦查、起诉、审判和判决执行等直接相关的；</p>
                    <p style={{ textIndent: 0 }}>4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
                    <p style={{ textIndent: 0 }}>5、所收集的个人信息是您自行向社会公众公开的；</p>
                    <p style={{ textIndent: 0 }}>6、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；</p>
                    <p style={{ textIndent: 0 }}>7、根据您的要求签订和履行合同所必需的；</p>
                    <p style={{ textIndent: 0 }}>8、用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；</p>
                    <p style={{ textIndent: 0 }}>9、法律法规规定的其他情形。</p>
                    <p style={{ textIndent: 0 }}><b>（七）您个人信息使用的规则</b></p>
                    <p style={{ textIndent: 0 }}>1、我们会根据本隐私政策的约定，在实现我们的产品与/或服务功能所必要的范围内，对所收集的个人信息进行使用。</p>
                    <p style={{ textIndent: 0 }}>2、在收集您的个人信息后，我们可能将通过技术手段对部分数据进行匿名化处理，匿名化处理的信息将无法识别主体。<b>请您了解并同意，在此情况下我们有权使用已经匿名化的信息；并在不透露您个人信息的前提下，我们有权对用户数据库进行分析并予以商业化的利用。</b></p>
                    <p style={{ textIndent: 0 }}><b>3、请您注意，您在使用我们的产品与/或服务时所提供的所有个人信息，除非您删除、通过系统设置或联系我们等方式撤回您的同意，否则将在您使用我们的产品与/或服务期间持续授权我们使用。在您注销账户时，我们将停止授权我们使用。在您注销账户时，我们将停止使用并删除您的个人信息。</b></p>
                    <p style={{ textIndent: 0 }}>4、我们会对我们的产品与/或服务使用情况进行统计，并可能会与公众或第三方共享这些统计信息，以展示我们的产品与/或服务的整体使用趋势。但这些统计信息不包含您的任何身份识别信息。</p>
                    <p style={{ textIndent: 0 }}>5、当我们展示您的个人信息时，我们会采用包括内容替换、去标识化处理等方式对您的信息进行脱敏，以保护您的信息安全。</p>
                    <p style={{ textIndent: 0 }}><b>二、我们如何共享、转让、公开披露您的个人信息 </b></p>
                    <p style={{ textIndent: 0 }}>（一）共享</p>
                    <p style={{ textIndent: 0 }}>1、我们不会与e站房屋以外的任何无关联公司、组织和个人共享您的个人信息，但以下情况除外：</p>
                    <p style={{ textIndent: 0 }}><b>（1）</b>事先获得您明确的同意或授权；</p>
                    <p style={{ textIndent: 0 }}><b>（2）</b>与国家安全、国防安全直接相关的；</p>
                    <p style={{ textIndent: 0 }}><b>（3）</b>与公共安全、公共卫生、重大公共利益直接相关的；</p>
                    <p style={{ textIndent: 0 }}><b>（4）</b>与犯罪侦查、起诉、审判和判决执行等直接相关的；</p>
                    <p style={{ textIndent: 0 }}><b>（5）</b>出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</p>
                    <p style={{ textIndent: 0 }}><b>（6）</b>自行向社会公众公开的个人信息；</p>
                    <p style={{ textIndent: 0 }}><b>（7）</b>从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</p>
                    <p style={{ textIndent: 0 }}>2、经您授权后，我们可能会向合作伙伴等第三方共享您的订单信息、账户信息、设备信息以及位置信息，以保障为您提供的服务顺利完成。但我们仅会处于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。但合作伙伴无权将共享的个人信息用于其他任何用途。</p>
                    <p style={{ textIndent: 0 }}>3、为了遵守法律、执行或适用我们的使用条件和其他协议，或者为了保护e站房屋平台、您或其他e站房屋客户的权利及其财产或安全，比如为防止欺诈等违法活动和减少信用风险，而与其他公司和组织交换信息，比如为了确认您的履约能力，我们会向第三方征信机构提供您的<b>身份证件信息</b>以获取您在<b>征信机构的个人信用</b>。前述共享行为并不包括违反本隐私政策中所作的承诺而为获利目的出售、出租、共享或以其它方式披露的个人信息。</p>
                    <p style={{ textIndent: 0 }}><b>三、我们如何保护和保存您的个人信息</b></p>
                    <p style={{ textIndent: 0 }}>(一)我们保护您个人信息的技术与措施</p>
                    <p>我们非常重视个人信息安全，并采取一切合理可行的措施，保护您的个人信息：</p>
                    <p style={{ textIndent: 0 }}>1、数据安全技术措施</p>
                    <p>e站房屋采取安全技术和管理措施来防止您的个人信息遭到未经授权访问使用、公开披露、使用、修改、损坏或丢失，包括但不限于：</p>
                    <p style={{ textIndent: 0 }}>（1）e站房屋采取加密技术对用户个人信息进行加密保存，并通过隔离技术进行隔离。在个人信息使用时，例如个人信息展示、个人信息关联计算，我们会采用包括内容替换在内多种数据脱敏技术增强个人信息在使用中安全性脱敏技术增强个人信息在使用中安全性；</p>
                    <p style={{ textIndent: 0 }}>（2）e站房屋采取严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违规使用；</p>
                    <p style={{ textIndent: 0 }}>（3）e站房屋采取数据访问日志分析技术进行个人信息安全审计。</p>
                    <p style={{ textIndent: 0 }}>2、e站房屋为保护个人信息采取的其他安全措施</p>
                    <p style={{ textIndent: 0 }}>3、我们建议您使用电子邮件、即时通讯、社交软件等交流工具时使用复杂密码，并注意保护您的个人信息安全。</p>
                    <p style={{ textIndent: 0 }}>4、我们将尽力确保您发送给我们的任何信息的安全性。</p>
                    <p style={{ textIndent: 0 }}>5、安全事件处置</p>
                    <p>为应对个人信息泄露、损毁和丢失的风险，我们制定了多项制度并成立了应急响应团队。我们按照安全事件的处置规范，针对不同安全事件启动安全预案，进行止损、分析、定位、制定补救措施、联合相关部门进行溯源和打击。</p>
                    <p style={{ textIndent: 0 }}>6、如果您发现自己的个人信息泄密或我们存在有安全弱点、可疑安全事件时，尤其是您的账户及密码发生泄露，请您立即联络我们，以便我们采取相应措施，禁止私自尝试或验证弱点。</p>
                    <p style={{ textIndent: 0 }}>7、如果您对我们的个人信息保护有任何疑问，可联系我们。</p>
                    <p style={{ textIndent: 0 }}>（二）您个人信息的保存</p>
                    <p style={{ textIndent: 0 }}>1、您的个人信息将会被存储于中华人民共和国境内。</p>
                    <p style={{ textIndent: 0 }}>2、当您成功申请注销e站房屋账户后，我们将在您提出申请后完成对您的账户注销审核，审核通过后，我们将对您的个人信息进行删除或匿名化处理。</p>
                    <p style={{ textIndent: 0 }}>3、如果我们终止服务或运营，我们会至少提前三十日向您通知，并在终止服务或运营后对您的个人信息进行删除或匿名化处理。</p>
                    <p style={{ textIndent: 0 }}><b>四、您如何管理您的个人信息</b></p>
                    <p>e站房屋非常重视您对个人信息的关注，并尽全力保护您对于您个人信息访问、更正、删除以及撤回同意的权利，以使您拥有充分的能力保障您的隐私和安全。您的权利包括：</p>
                    <p style={{ textIndent: 0 }}>1、访问和更正您的个人信息</p>
                    <p style={{ textIndent: 0 }}>除法律法规规定外，您有权随时访问和更正您的个人信息，具体包括：</p>
                    <p style={{ textIndent: 0 }}>（1）您的账户信息：您可更新除实名认证信息之外的其他个人信息（您的实名认证信息是您通过实名认证时使用的姓名和身份证信息）。如您需要变更您的实名认证信息，您可向我们申请变更。</p>
                    <p style={{ textIndent: 0 }}>（2）您的浏览信息：您可以访问或清除您的搜索历史记录、查看和修改兴趣以及管理其他数据。</p>
                    <p style={{ textIndent: 0 }}>（3）您的评论信息：您可以访问或更新或清除您的个人评论。</p>
                    <p style={{ textIndent: 0 }}>（4）对于您在使用我们的产品与/或服务过程中产生的其他个人信息需要访问或更正，请随时联系我们。我们会根据本隐私政策所列明的方式和期限响应您的请求。</p>
                    <p style={{ textIndent: 0 }}>（5）您无法访问和更正的个人信息：除上述列明的信息外，考虑到不响应请求可能给您合法权益带来的风险和损害、技术可行性及实现请求成本等因素，您的部分个人信息我们还无法为您提供访问和更正的服务，这些信息主要是为了提升您的用户体验和保证交易安全所收集的您的设备信息、您使用附加功能时产生的个人信息。上述信息我们会在您的授权范围内进行使用，您无法访问和更正，但您可联系我们进行删除或做匿名化处理。</p>
                    <p style={{ textIndent: 0 }}>2、删除您的个人信息</p>
                    <p style={{ textIndent: 0 }}>您在我们的产品与/或服务页面中可以直接清除或删除的信息，包括看房记录、订单信息、 浏览信息、收货地址信息；</p>
                    <p style={{ textIndent: 0 }}>在以下情形中，您可以向我们提出删除个人信息的请求：</p>
                    <p style={{ textIndent: 0 }}>（1）如果我们处理个人信息的行为违反法律 法规；</p>
                    <p style={{ textIndent: 0 }}>（2）如果我们收集、使用您的个人信息，却未征得您的同意；</p>
                    <p style={{ textIndent: 0 }}>（3）如果我们处理个人信息的行为违反了与您的约定；</p>
                    <p style={{ textIndent: 0 }}>（4）如果您注销了e站房屋账户；</p>
                    <p style={{ textIndent: 0 }}>（5）如果我们终止服务及运营。</p>
                    <p style={{ textIndent: 0 }}>3、改变您授权同意的范围或撤回您的授权</p>
                    <p>您可以通过删除信息、关闭设备功能、在e站房屋网站或软件中进行隐私设置等方式改变您授权我们继续收集个人信息的范围或撤回您的授权。您也可以通过注销账户的方式，撤回我们继续收集、处理您个人信息的全部授权。</p>
                    <p>请您理解，每个业务功能需要一些基本的个人信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理。</p>
                    <p style={{ textIndent: 0 }}>4、注销账户</p>
                    <p>您注销账户后，我们将停止为您提供产品与/或服务，并依据您的要求，除法律法规另有规定外，我们将删除您的个人信息。</p>
                    <p style={{ textIndent: 0 }}>您的账户一旦注销，将面临如下风险及问题：</p>
                    <p style={{ textIndent: 0 }}>（1）账户内未完成的订单、服务会因您账户注销而无法继续执行。</p>
                    <p style={{ textIndent: 0 }}>（2）如您的账户因违法违规操作或侵犯他人合法权益导致处罚或纠纷，我们将 在必要的期限内保留处理此纠纷、投诉所必要的信息，并在该等期限届满后对相关个人信息进行删除或匿名化处理；</p>
                    <p style={{ textIndent: 0 }}>5、如果您不想接受我们给您发送的促销信息，您随时可取消。</p>
                    <p style={{ textIndent: 0 }}>6、响应您的请求</p>
                    <p>如果您无法访问、更正或删除您的个人信息，或您需要访问、更正或删除您在使用我们产品与/或服务时所产生的其他个人信息，或您认为e站房屋存在任何违反法律法规或信息，或您认为e站房屋存在任何违反法律法规或 与您关于个人信息的收集或使用的约定，您可与我们联系。</p>
                    <p>为了保障安全，我们可能需要您提供书面请求，或以其他方式证明您的身份，我们将在收到您反馈并验证您的身份后的30天内答复您的请求。对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如， 涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。</p>
                    <p>在以下情形中，按照法律法规要求，我们将可能无法响应您的请求：</p>
                    <p style={{ textIndent: 0 }}><b>（1）</b>与国家安全、国防安全直接相关的；</p>
                    <p style={{ textIndent: 0 }}><b>（2）</b>与公共安全、公共卫生、重大公共利益直接相关的；</p>
                    <p style={{ textIndent: 0 }}><b>（3）</b>与犯罪侦査、起诉、审判和执行判决等；</p>
                    <p style={{ textIndent: 0 }}><b>（4）</b>有充分证据表明您存在主观恶意或滥用权利的；</p>
                    <p style={{ textIndent: 0 }}><b>（5）</b>响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；</p>
                    <p style={{ textIndent: 0 }}><b>（6）</b>涉及商业秘密的。</p>
                    <p style={{ textIndent: 0 }}>五、未成年人的个人信息保护</p>
                    <p style={{ textIndent: 0 }}>1、e站房屋非常重视对未成年人个人信息的保护。若您是18周岁以下的未成年人，在使用我们的产品与/或服务前，应事先取得您家长或法定监护人的书面同意。e站房屋根据国家相关法律法规的规定保护未成年人的个人信息。</p>
                    <p style={{ textIndent: 0 }}>2、对于经父母或法定监护人同意而收集未成年人个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。</p>
                    <p style={{ textIndent: 0 }}>3、如果我们发现自己在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。</p>
                    <p style={{ textIndent: 0 }}>六、通知和修订</p>
                    <p style={{ textIndent: 0 }}>1、为给您提供更好的服务以及随着e站房屋业务的发展，本隐私政策也会随之更新。但未经您明确同意，我们不会削减您依据本隐私政策所应享有的权利。我们会通过在e站房屋网站、e站房屋移动端APP上发出更新版本并在生效前通过网站公告或以其他适当方式提醒您相关内容的更新，也请您访问e站房屋以便及时了解最新的隐私政策。</p>
                    <p><b>我们谨此再次提醒您，本隐私政策内容中以加粗方式显著标识的条款，请您着重阅读。您点击“注册”/"登录”按钮即视为您完全接受本隐私政策，在点击之前请您再次确认已知悉并完全理解本隐私政策的全部内容。 </b></p>
                    <p><b>我们基于您接受本隐私政策而使用您的相关信息，您承诺不追究我们的责任。包括但不限于追究侵权责任、保密责任；也不要求我们赔偿损失、赔礼道歉等。我们也向您承诺：使用您的信息皆旨在为您提供更好的服务，我们一定在本隐私政策的范围内合法合规合理地使用您的信息。</b></p>
                </Modal>
            </Form>
        );
    }
}

const InformationForm =connect(state=>(
    {userInformation:state.userInformation}),{setUserInformation})(Form.create({name: 'retrieve'})(withRouter(Information)));

class Register extends React.Component {
    constructor(props) {
        super(props)
        this.state = {
            visible: false,
            weixin: true,
            register: true
        };
    }

    callback = e => {
        if (e === '5') {
            this.setState({
                key: e,
                identity: '用户'
            });
        }
        else if (e === '3') {
            this.setState({
                key: e,
                identity: '经纪人'
            });
        }
        else if (e === '4') {
            this.setState({
                key: e,
                identity: "置业顾问"
            });
        }

    }

    handleCancel() {
        this.setState({
            register: false
        })
    };

    onChange(e) {
        console.log(`checked = ${e.target.checked}`);
    }

    render() {
        const {TabPane} = Tabs;
        const {register} = this.props;

        return (
            <div className={'register'}>
                <Modal
                    visible={register}
                    width={390}
                    destroyOnClose={true}
                    onCancel={this.props.handleCancel}
                    footer={''}
                >
                    <div className={'item'}>
                        <p className={'title'}>账号注册</p>
                        <Tabs defaultActiveKey="1" onChange={this.callback}>
                            <TabPane tab="普通用户" key="1">
                                <InformationForm id={'user'} tab={'用户'} role={'5'}
                                                 handleClose={this.props.handleCancel}></InformationForm>
                            </TabPane>
                            <TabPane tab="经纪人" key="2">
                                <InformationForm id={'user'} tab={'经纪人'} role={'3'} handleClose={this.props.handleCancel}></InformationForm>
                            </TabPane>
                            <TabPane tab="置业顾问" key="3">
                                <InformationForm id={'user'} tab={'置业顾问'} role={'4'} handleClose={this.props.handleCancel}></InformationForm>
                            </TabPane>
                        </Tabs>
                    </div>
                </Modal>
            </div>
        );
    }
}

export default connect(state=>(
    {userInformation:state.userInformation}),{setUserInformation})(withRouter(Register))
